const topic2List = [
  "ข้อมูลระบุตัวตน (Personal data) เช่น ชื่อ นามสกุล เพศ วันเดือนปีเกิด เลขที่บัตรประชาชน",
  "ข้อมูลประวัติการศึกษาและความเชี่ยวชาญ (Education and Specialist) (เฉพาะผู้ให้บริการ) เช่น ประวัติการศึกษา เอกสารรับรองคุณสมบัติ",
  "ข้อมูลสำหรับการติดต่อ (Contact data) เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล ข้อมูลการติดต่อญาติ",
  "ข้อมูลการบริการ (Usage data) เช่น ประวัติการจอง การยกเลิก การบริการ เป็นต้น",
  "ข้อมูลการเงิน (Financial data) เช่น รายละเอียดบัญชีธนาคาร ประวัติการจ่ายเงิน ประวัติการคืนเงิน",
  "ข้อมูลสถิติ (Statistical Data) เช่น ข้อมูลที่ไม่ระบุตัวตน จำนวนผู้รับบริการ จำนวนนักจิตวิทยา และจำนวนการเข้าชมเว็บไซต์",
  "ข้อมูลจากการเข้าใช้เว็บไซต์ (Technical data) เช่น หมายเลข IP Address ของคอมพิวเตอร์ ชนิดของบราวเซอร์ ข้อมูล Cookies ระบบปฏิบัติการ แพลตฟอร์มและเทคโนโลยีของอุปกรณ์ที่ใช้เข้าเว็บไซต์ และ Online Appointment System",
  "ข้อมูลบันทึกการปรึกษา เช่น บันทึกถึงผู้รับบริการ บันทึกถึงนักจิตวิทยา ความคิดเห็น และคำแนะนำเพิ่มเติม",
  "ข้อมูลอื่น ๆ ที่ได้รับจากการกรอกข้อความผ่านแอพพลิเคชั่น หรือเว็บไซต์ เช่น รีวิว ความเห็นต่อการให้บริการ",
];

const topic3List = [
  "การที่ท่านกรอกรายละเอียดหน้าประวัติผู้ใช้งาน หรือใบสมัคร",
  "การที่ท่านติดต่อกับบริษัทเพื่อสอบถามข้อมูลเรื่องการบริการของบริษัท",
  "การที่ท่านเป็นผู้รับบริการ หรือสมัครเข้าใช้งาน",
  "การที่ท่านเป็นคู่สัญญากับบริษัท",
];

const purposeTableRows = [
  {
    purpose:
      "เพื่อวัตถุประสงค์ในการให้บริการ ซึ่งรวมถึงการให้คำปรึกษา การใช้เว็บไซต์ของบริษัท และ/หรือแอพพลิเคชั่นของบริษัท การชำระค่าบริการ และ/หรือการทำธุรกรรมอื่น ๆ ที่เกี่ยวข้องกับบริการ",
    legalBasis: "ฐานสัญญา ฐานความจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย",
  },
  {
    purpose: "เพื่อประโยชน์ในการให้บริการ",
    legalBasis: "ฐานสัญญา ฐานความจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย",
  },
  {
    purpose:
      "เพื่อวัตถุประสงค์ในการจัดการความสัมพันธ์ของท่านกับบริษัท และ/หรือให้บริการที่เกี่ยวข้องแก่ท่าน",
    legalBasis: "ฐานสัญญา ฐานความจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย",
  },
  {
    purpose:
      "เพื่อรวบรวมสถิติของผู้รับบริการเพื่อพัฒนาคุณภาพการให้บริการของบริษัท ซึ่งรวมถึงเพื่อรวบรวมข้อเสนอแนะต่าง ๆ",
    legalBasis: "ฐานสัญญา ฐานความจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย",
  },
  {
    purpose: "เพื่อบริหารจัดการเว็บไซต์ และ/หรือแอพพลิเคชั่นของบริษัท",
    legalBasis: "ฐานสัญญา ฐานความจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย",
  },
  {
    purpose:
      "เพื่อปฏิบัติตามข้อตกลงและเงื่อนไข (Terms and Conditions) และเพื่อปฏิบัติตามกฎหมายและกฎระเบียบของหน่วยงานราชการ",
    legalBasis: "ฐานสัญญา ฐานความจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย",
  },
];

const Policy = () => {
  return (
    <div className="mt-14.75 w-full max-w-245 px-4 s:px-6 m:px-8 pb-24 flex flex-col">
      <h1 className="rf-h4 font-normal text-center text-neutral-black mb-8">
        ข้อกำหนดและเงื่อนไข
      </h1>

      {/* intro */}
      <section className="text-neutral-grey">
        <p className="rf-body text-neutral-grey">
          บริษัทมายด์บอทจำกัด ("บริษัท") และ บริการมายด์บลูม (MindBloom)
          ซึ่งรวมถึงการให้บริการคำปรึกษาด้านสุขภาพจิตผ่านแอพพลิเคชั่นมือถือ
          MindBloom - Telecounseling, MindBloom therapist – Telecounseling
          และเว็บไซต์ www.mindbloom-wellness.com (ต่อไปนี้จะเรียกว่า
          "มายด์บลูม") ให้ความสำคัญกับการคุ้มครองข้อมูลส่วนบุคคล
          และในฐานะที่เป็นผู้ควบคุมข้อมูลส่วนบุคคลตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
          พ.ศ. 2562 ("พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล")
          บริษัทมีหน้าที่ตามกฎหมายในการแจ้งเอกสารฉบับนี้ให้ท่านทราบถึงเหตุผลและวิธีการที่บริษัทเก็บรวบรวม
          ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
          รวมถึงแจ้งให้ท่านทราบสิทธิของท่านในฐานะเจ้าของข้อมูลส่วนบุคคล
          นโยบายความเป็นส่วนตัวนี้กำหนดพื้นฐานที่บริษัทมายด์บอทจำกัด และ
          บริการมายด์บลูมอาจรวบรวม ใช้ เปิดเผย
          หรือประมวลผลข้อมูลส่วนบุคคลของผู้รับบริการและ/หรือผู้ให้บริการของบริษัท
          เมื่อท่านใช้เว็บไซต์ www.mindbloom-wellness.com ("เว็บไซต์")
          และ/หรือแอพพลิเคชั่นมือถือ MindBloom – Telecounseling และ/หรือ
          แอพพลิเคชั่นมือถือ MindBloom therapist - Telecounseling
          (รวมทั้งหมดเรียกว่า "แอพพลิเคชั่น") ตาม พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล
          นโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ ("นโยบาย")
          ได้อธิบายและประกอบด้วยข้อมูลสำคัญ ได้แก่ (ก)
          ข้อมูลส่วนบุคคลที่บริษัทเก็บรวบรวมจากท่าน (ข)
          แหล่งที่มาของข้อมูลส่วนบุคคล (ค) วัตถุประสงค์ในการเก็บรวบรวม ใช้
          และเปิดเผยข้อมูลส่วนบุคคล (ง) การเปิดเผยหรือแบ่งปันข้อมูลส่วนบุคคล (จ)
          ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล (ฉ)
          มาตรการในการเก็บรักษาและประมวลผลข้อมูลส่วนบุคคล (ช)
          สิทธิของเจ้าของข้อมูลส่วนบุคคล
          บริษัทขอแจ้งให้ท่านทราบว่านโยบายฉบับนี้อาจมีการเปลี่ยนแปลงเป็นครั้งคราวเพื่อให้สอดคล้องกับกฎหมาย
          ซึ่งการเปลี่ยนแปลงใด ๆ จะถูกเผยแพร่บนเว็บไซต์ของมายด์บลูม
          และ/หรือแอพพลิเคชั่นของมายด์บลูม
          ในการนี้บริษัทขอแนะนำให้ท่านตรวจสอบนโยบายฉบับนี้เป็นประจำโดยเข้าไปที่เว็บไซต์ของมายด์บลูม
          และ/หรือแอพพลิเคชั่นของมายด์บลูม
        </p>
      </section>

      {/* 1 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">1. เราเป็นใครและเราทำอะไร</p>
        <p className="rf-body text-neutral-grey indent-12">
          บริษัท มายด์บอท จำกัด ("บริษัท") ผู้พัฒนาเทคโนโลยีด้านสุขภาพจิต
          ประกอบด้วยเว็บไซต์ www.mindbloom-wellness.com และแอพพลิเคชั่นมือถือ
          MindBloom – Telecounseling และแอพพลิเคชั่นมือถือ MindBloom therapist –
          Telecounseling (รวมทั้งหมดเรียกว่า "มายด์บลูม")
          ซึ่งให้บริการคำปรึกษาด้านสุขภาพจิตผ่านระบบผ่านระบบวิดิโอคอลหรือเทคโนโลยีการสื่อสารทางไกลผ่านระบบจอภาพ
          (teleconference) [NM1] [A2]
          ให้แก่ผู้ใช้บริการที่ต้องการคำปรึกษาด้านสุขภาพจิต ("ผู้รับบริการ")
          จากผู้เป็นผู้ประกอบโรคศิลปะสาขาจิตวิทยาคลินิก
          ("ผู้ให้บริการ"/"นักจิตวิทยาคลินิก"/"นักจิตวิทยา")
        </p>
        <p className="rf-body text-neutral-grey indent-12">
          ทั้งนี้นักจิตวิทยาที่ให้บริการในมายด์บลูมทุกท่านมิได้เป็นลูกจ้างหรือบุคคลที่บริษัทว่าจ้างมาเพื่อให้บริการแก่ผู้รับบริการโดยตรง
          นักจิตวิทยาทุกท่านเป็นผู้เลือกให้บริการคำปรึกษาผ่านมายด์บลูมอย่างอิสระ
          เพื่อให้คำปรึกษาด้านสุขภาพจิตแก่ผู้รับบริการ
          ซึ่งนักจิตวิทยาแต่ละท่านจะเป็นผู้รับผิดชอบต่อการให้คำแนะนำและการร้องเรียนของผู้รับบริการแต่ละท่านเอง
          บริษัทหรือบุคคลภายนอกที่นำเสนอบริการ หรือจัดหาลิงค์ (link)
          นั้นไม่มีผลผูกพันต่อคำแนะนำใด ๆ ที่ผู้รับบริการได้รับจากนักจิตวิทยา
        </p>
        <p className="rf-body text-neutral-grey indent-12">
          บริษัทจะไม่มีการแทรกแซงในการให้คำปรึกษาของนักจิตวิทยา
          นักจิตวิทยาแต่ละท่านจะเป็นผู้รับผิดชอบในคำแนะนำเกี่ยวกับการให้คำปรึกษา
          และการร้องเรียนจากผู้รับบริการ
        </p>
      </section>

      {/* 2 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          2. ข้อมูลส่วนบุคคลที่บริษัท เก็บรวบรวมจากท่าน
        </p>
        <p className="rf-body  indent-12">
          ข้อมูลส่วนบุคคลของท่านที่บริษัทเก็บรวบรวม
          สามารถจำแนกเป็นประเภทดังต่อไปนี้
        </p>
        <div>
          <p className="rf-body">2.1ข้อมูลส่วนบุคคลทั่วไป</p>
          <ul className="rf-body mt-2 list-disc space-y-1 pl-15 text-neutral-grey marker:text-neutral-grey">
            {topic2List.map((item, index) => (
              <li key={index} className="leading-relaxed">
                {item}
              </li>
            ))}
          </ul>
        </div>
      </section>
      {/* 3 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          3. แหล่งที่มาของข้อมูลส่วนบุคคล
        </p>
        <p className="rf-body  indent-12">
          บริษัทเก็บรวบรวมข้อมูลส่วนบุคคลของท่านจากแหล่งที่มาดังต่อไปนี้
          ข้อมูลส่วนบุคคลที่ได้โดยตรงจากท่านไม่ว่าจะด้วยตนเอง
          หรือผ่านช่องทางออนไลน์ ได้แก่
        </p>
        <ul className="rf-body mt-2 list-disc space-y-1 pl-15 text-neutral-grey marker:text-neutral-grey">
          {topic3List.map((item, index) => (
            <li key={index} className="leading-relaxed">
              {item}
            </li>
          ))}
        </ul>
      </section>
      {/* 4 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          4. วัตถุประสงค์ในการเก็บรวบรวม ใช้ วิธีการให้ความยินยอม
        </p>
        <p className="rf-body  indent-12">
          บริษัทจะประมวลผลข้อมูลส่วนบุคคลของท่านภายใต้ขอบเขตที่กำหนดไว้โดยพ.ร.บ.
          คุ้มครองข้อมูลส่วนบุคคล
          และเก็บรวบรวมข้อมูลเพียงเท่าที่จำเป็นสำหรับการดำเนินการดังกล่าว
          อีกทั้งอาจใช้ รวบรวม
          และประมวลผลข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ต่าง ๆ
          ที่กำหนดไว้ด้านล่าง (“วัตถุประสงค์”)
          โดยบริษัทได้สรุปการใช้ข้อมูลส่วนบุคคลของท่าน
          พร้อมทั้งอธิบายฐานการประมวลผลข้อมูลส่วนบุคคลที่ชอบด้วยกฎหมาย (Lawful
          Basis of Processing) ดังนี้
        </p>
        <div>
          <p className="rf-body">4.1 วัตถุประสงค์ในการเก็บรวบรวม</p>
          <div className="mt-3 overflow-hidden rounded-4xl bg-[#F4F2ED]">
            <table className="w-full table-fixed border-collapse">
              <thead>
                <tr className="bg-[#C7CCBF] text-neutral-black">
                  <th className="w-1/2 px-5 py-4 text-center rf-body font-bold">
                    วัตถุประสงค์
                  </th>
                  <th className="w-1/2 px-5 py-4 text-center rf-body font-bold">
                    ฐานทางกฎหมาย
                  </th>
                </tr>
              </thead>
              <tbody>
                {purposeTableRows.map((row, index) => (
                  <tr key={index} className="align-top">
                    <td className="px-5 py-3 rf-body text-neutral-grey leading-relaxed">
                      {row.purpose}
                    </td>
                    <td className="px-5 py-3 rf-body text-neutral-grey leading-relaxed">
                      {row.legalBasis}
                    </td>
                  </tr>
                ))}
              </tbody>
            </table>
          </div>
        </div>
        <p className="rf-body mt-2">
          4.2 การให้ความยินยอมเพื่อเก็บรวบรวมข้อมูลส่วนบุคคล
        </p>
        <p className="rf-body indent-12">
          {" "}
          การลงทะเบียนเข้าใช้งานเว็บไซต์หรือแอพพลิเคชั่น
          หรือการให้ความยินยอมเป็นลายลักษณ์อักษร
          ถือเป็นการยินยอมให้บริษัทเก็บรวบรวมข้อมูลของท่าน
          เพื่อวัตถุประสงค์ที่เกี่ยวข้องกับนโยบายคุ้มครองข้อมูลส่วนบุคคล
        </p>
      </section>

      {/* 5 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          5. บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลของท่านให้ใครบ้าง
        </p>
        <p className="rf-body  indent-12">
          บริษัทจะไม่เปิดเผยข้อมูลส่วนบุคคลของท่านให้บุคคลภายนอก
          ยกเว้นเป็นกรณีที่กฎหมายอนุญาตเพื่อความจำเป็นในการปฏิบัติงาน
          ซึ่งทำให้บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลได้ในกรณีต่อไปนี้
        </p>
        <p className="rf-body">
          5.1 เปิดเผยข้อมูลส่วนบุคคลให้หน่วยงานราชการ
          หน่วยงานผู้มีอำนาจหรือบุคคลใด ๆ เมื่อมีกฎหมายกำหนดหรือให้อำนาจ
          รวมถึงการปฏิบัติตามคำสั่งศาล
        </p>
        <p className="rf-body">
          5.2
          การเปิดเผยข้อมูลส่วนบุคคลให้กับบุคคลหรือนิติบุคคลที่บริษัทจำเป็นต้องปฏิบัติตามสัญญาเพื่อผลประโยชน์ของท่านในฐานะเจ้าของข้อมูลส่วนบุคคล
          อีกทั้งเพื่อปรับปรุงและพัฒนาบริการของบริษัท
          เพื่อประโยชน์ของท่านและผู้อื่นมากขึ้น
        </p>
        <p className="rf-body  indent-12">
          โดยบริษัทกำหนดให้บุคคลหรือนิติบุคคลภายนอกที่บริษัทเปิดเผยหรือแบ่งปันข้อมูลส่วนบุคคลของท่านให้ไปข้างต้นต้องรักษาความลับและคุ้มครองข้อมูลส่วนบุคคลของท่านตามมาตรฐานที่พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
          พ.ศ. 2562 กำหนด
          และใช้ข้อมูลส่วนบุคคลของท่านได้เฉพาะตามวัตถุประสงค์ที่ได้กำหนดไว้ระหว่างบริษัทและบุคคลหรือนิติบุคคลภายนอกนั้น
          เพื่อป้องกันการเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบ
          และป้องกันการใช้ข้อมูลส่วนบุคคลของท่านนอกเหนือจากวัตถุประสงค์ที่ได้ตกลงกันไว้
        </p>
      </section>
      {/* 6 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          6. ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล
        </p>
        <p className="rf-body  indent-12">
          บริษัทจะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้ตามระยะเวลาเท่าที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์ในการประมวลผลและปฏิบัติตามกฎหมาย
          อย่างไรก็ตามบริษัทอาจจำเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น
          หากมีกฎหมายกำหนดไว้ บริษัทจะลบ ทำลาย
          หรือทำให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของท่านได้
          เมื่อหมดความจำเป็นหรือสิ้นสุดระยะเวลาดังกล่าว
        </p>
      </section>

      {/* 7 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          7. สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคล
        </p>
        <p className="rf-body">
          7.1 สิทธิในการขอเข้าถึง ขอรับข้อมูลหรือสำเนาข้อมูล
        </p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิขอเข้าถึง หรือรับ
          ข้อมูลส่วนบุคคลของท่านเองที่อยู่ในความรับผิดชอบของบริษัท
          และขอให้บริษัททำสำเนาข้อมูลดังกล่าวให้แก่ท่าน
          รวมถึงขอให้เปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่ท่านไม่ได้ให้ความยินยอมว่าได้ข้อมูลส่วนบุคคลของท่านมาได้อย่างไร
        </p>
        <p className="rf-body">7.2 สิทธิขอถ่ายโอนข้อมูล</p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิขอรับข้อมูลส่วนบุคคลของท่านในกรณีที่บริษัทได้จัดทำข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติ
          และสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ
          รวมทั้งมีสิทธิขอให้บริษัทส่งหรือโอนข้อมูลส่วนบุคคลของท่านในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทำได้ด้วยวิธีการอัตโนมัติ
        </p>
        <p className="rf-body">7.3 สิทธิขอคัดค้าน</p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิขอคัดค้านการเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคลของท่านในเวลาใดก็ได้
          หากท่านสงสัยว่าการเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคลของท่านขัดต่อวัตถุประสงค์
          หรือการดำเนินงานที่จำเป็นภายใต้ประโยชน์โดยชอบด้วยกฎหมายของบริษัทที่ท่านสามารถคาดหมายได้อย่างสมเหตุสมผล
          หรือเพื่อดำเนินการตามภารกิจเพื่อสาธารณประโยชน์
        </p>
        <p className="rf-body">7.4 สิทธิขอให้ลบหรือทำลายข้อมูล</p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิขอลบหรือทำลายข้อมูลส่วนบุคคลของท่าน
          หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวท่านได้
          หากท่านเชื่อว่าข้อมูลส่วนบุคคลของท่านถูกเก็บรวบรวม ใช้
          และ/หรือเปิดเผยโดยไม่ชอบด้วยกฎหมายที่เกี่ยวข้อง
          หรือเห็นว่าบริษัทหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้
          หรือเมื่อท่านได้ใช้สิทธิขอถอนความยินยอมหรือใช้สิทธิขอคัดค้านตามที่แจ้งไว้ข้างต้นแล้ว
        </p>
        <p className="rf-body">7.5 สิทธิขอให้ระงับการใช้ข้อมูล</p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลชั่วคราว
          ในกรณีที่บริษัทอยู่ระหว่างตรวจสอบตามคำร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอใช้สิทธิคัดค้านของท่าน
          หรือกรณีอื่นใดที่บริษัทหมดความจำเป็นและต้องลบหรือทำลายข้อมูลส่วนบุคคลของท่านตามกฎหมายที่เกี่ยวข้อง
          แต่ท่านขอให้บริษัทระงับการใช้แทน
        </p>
        <p className="rf-body">7.6 สิทธิขอให้แก้ไขข้อมูล</p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้อง เป็นปัจจุบัน
          สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด
        </p>
        <p className="rf-body">7.7 สิทธิร้องเรียน</p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิร้องเรียนต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง
          หากท่านเชื่อว่าการเก็บรวบรวม ใช้ และ /
          หรือเปิดเผยข้อมูลส่วนบุคคลของท่านเป็นการกระทำในลักษณะที่ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง
        </p>
        <p className="rf-body">7.8 สิทธิในการขอถอนความยินยอม</p>
        <p className="rf-body indent-12">
          ท่านมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับบริษัท
          เว้นแต่มีข้อจำกัดสิทธินั้นโดยกฎหมายหรือมีสัญญาที่ให้ประโยชน์แก่ท่านอยู่
        </p>
        <p className="rf-body indent-12">
          การใช้สิทธิของท่านดังกล่าวข้างต้นอาจถูกจำกัดภายใต้กฎหมายที่เกี่ยวข้อง
          และมีบางกรณีที่มีเหตุจำเป็นที่บริษัทอาจปฏิเสธหรือไม่สามารถดำเนินการตามคำขอใช้สิทธิข้างต้นของท่านได้
          เช่น ต้องปฏิบัติตามกฎหมายหรือคำสั่งศาล เพื่อประโยชน์สาธารณะ
          การใช้สิทธิอาจละเมิดสิทธิหรือเสรีภาพของบุคคลอื่น เป็นต้น
          หากบริษัทปฏิเสธคำขอข้างต้น
          บริษัทจะแจ้งเหตุผลของการปฏิเสธให้ท่านทราบด้วย
          อย่างไรก็ตามบริษัทอาจสงวนสิทธิในการระงับการให้บริการหากมีการถอนความยินยอมจากท่าน
        </p>
      </section>

      {/* 8 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          8. เราคุ้มครองข้อมูลส่วนบุคคลของท่านอย่างไร
        </p>
        <p className="rf-body  indent-12">
          บริษัทจะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้เป็นอย่างดีตามมาตรการเชิงเทคนิค
          (Technical Safeguard) มาตรการเชิงบริหารจัดการ (Administrative
          Safeguard) และมาตรการป้องกันทางกายภาพ (Physical Safeguard)
          เพื่อธำรงไว้ซึ่งความลับ ความถูกต้องครบถ้วน
          สภาพความพร้อมใช้งานของข้อมูลส่วนบุคคล เพื่อป้องกันการเข้าถึง
          เก็บรวบรวม เปลี่ยนแปลง แก้ไข ใช้ และ / หรือ
          เปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจหรือโดยมิชอบ
          ทั้งนี้เป็นไปตามที่กฎหมายที่ใช้บังคับกำหนด
        </p>
      </section>

      {/* 9 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">9. คุกกี้</p>
        <p className="rf-body  indent-12">
          เพื่อเพิ่มประสบการณ์การใช้งานของท่านให้มีประสิทธิภาพมากขึ้น
          บริษัทใช้คุกกี้เพื่อระบุและติดตามผู้ใช้งานเว็บไซต์และการเข้าถึงเว็บของมายด์บลูม
          และเพื่อพัฒนาการเข้าถึงสินค้า หรือบริการที่เหมาะสมกับการใช้งานของท่าน
        </p>

        <p className="rf-body  indent-12">
          โดยคุกกี้ คือ text files
          ที่อยู่ในคอมพิวเตอร์ของท่านที่ใช้เพื่อจัดเก็บรายละเอียดข้อมูล log
          การใช้งานอินเทอร์เน็ตของท่านหรือพฤติกรรมการเยี่ยมชมเว็บไซต์ของท่าน
          บริษัทใช้คุกกี้ในการจัดเก็บข้อมูลการเข้าเยี่ยมชมเว็บไซต์ของท่านเพื่อช่วยให้บริษัทสามารถจัดให้มีการบริการที่ดีขึ้น
          เร็วขึ้น และปลอดภัยขึ้น เมื่อท่านใช้บริการผ่านเว็บไซต์
          โดยบริษัทใช้คุกกี้ในกรณีดังต่อไปนี้
        </p>
        <ul className="rf-body mt-2 list-disc space-y-1 pl-15 text-neutral-grey marker:text-neutral-grey">
          <li className="leading-relaxed">
            คุกกี้เพื่อการทำงานของเว็บไซต์ (Functionality Cookies): <br />
            บริษัทใช้คุกกี้ประเภทนี้เพื่อช่วยให้บริษัทจดจำอุปกรณ์หรือบราวเซอร์ของท่านเพื่อให้บริษัทสามารถจัดทำเนื้อหาให้เหมาะสมกับความสนใจส่วนบุคคลของท่านได้รวดเร็วขึ้น
            และช่วยให้การบริการและแพลตฟอร์มสะดวกสบายและเป็นประโยชน์ต่อท่านมากขึ้น
            ในการปิดใช้งานคุกกี้นี้
            ท่านสามารถตั้งค่าอุปกรณ์ของท่านโดยดูวิธีการช่วยเหลือของเบราเซอร์หรืออุปกรณ์ของท่าน
          </li>
          <li className="leading-relaxed">
            คุกกี้เพื่อการวิเคราะห์ (Analytic cookies): <br />
            บริษัทใช้คุกกี้เพื่อการวิเคราะห์ที่ให้บริการโดยบุคคลภายนอกเพื่อเก็บข้อมูลว่าผู้เข้าชมเว็บไซต์ของบริษัทมีการใช้งานอย่างไร
            บริษัททำข้อมูลผู้เข้าชมเว็บไซต์เป็นข้อมูลนิรนามทั้งหมด
            (Anonymization)
            และส่งผ่านไปที่บุคคลภายนอกผู้ที่จะสามารถใช้ข้อมูลเหล่านี้หรือเปิดเผยข้อมูลเหล่านี้ให้กับบุคคลอื่นที่ประมวลผลข้อมูลให้ตามที่กฎหมายอนุญาต
            บุคคลภายนอกจะไม่รวมข้อมูลของท่านที่ได้ไปจากเว็บไซต์ของบริษัทกับข้อมูลที่บุคคลภายนอกมีอยู่แล้ว
            ท่านสามารถเลือกปิดการใช้งานคุกกี้ลักษณะนี้บนหน้าเว็บไซต์ของบริษัท
          </li>
        </ul>
      </section>

      {/* 10 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          10. การรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล
        </p>
        <p className="rf-body  indent-12">
          เพื่อปกป้องข้อมูลส่วนบุคคลของท่านจากการเข้าถึง รวบรวม ใช้ เปิดเผย
          แก้ไข ทำลาย หรือความเสี่ยงที่คล้ายกันโดยไม่ได้รับอนุญาต
          บริษัทแนะนำมาตรการการดูแลระบบทางกายภาพและทางเทคนิคที่เหมาะสม เช่น
          การอัปเดตการป้องกันไวรัส การเข้ารหัส และการเปิดเผยข้อมูลส่วนบุคคล
          ทั้งภายในและต่อผู้ให้บริการ ตัวแทนบุคคลที่สาม หรือบุคคลอื่นๆ
          ที่ได้รับอนุญาตตามความจำเป็นเท่านั้น
        </p>
      </section>

      {/* 11 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          11. การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล
        </p>
        <p className="rf-body  indent-12">
          หากเกิดเหตุละเมิดข้อมูลส่วนบุคคลของท่าน
          บริษัทจะแจ้งให้สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลทราบภายใน 72
          ชั่งโมงนับตั้งแต่ทราบเหตุ
          ในกรณีที่การละเมิดมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของท่าน
          บริษัทจะแจ้งการละเมิดให้ท่านทราบกับแนวทางการเยียวยาโดยเร็วที่สุดผ่านช่องทางต่างๆ
          เช่น อีเมล โทรศัพท์ เป็นต้น
        </p>
      </section>

      {/* 12 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          12. นโยบายความเป็นส่วนตัวของเว็บไซต์อื่น
        </p>
        <p className="rf-body  indent-12">
          นโยบายความเป็นส่วนตัวฉบับนี้
          ใช้กับเฉพาะข้อมูลที่บริษัทรวบรวมผ่านเว็บไซต์หรือแอพพลิเคชั่นของมายด์บลูมเท่านั้น
          หากท่านเข้าชมเว็บไซต์อื่น
          แม้จะผ่านช่องทางเว็บไซต์หรือแอพพลิเคชั่นของมายด์บลูม
          การคุ้มครองข้อมูลส่วนบุคคลต่าง ๆ
          จะเป็นไปตามนโยบายความเป็นส่วนตัวของเว็บไซต์นั้น
          โดยบริษัทไม่มีส่วนเกี่ยวข้องด้วย
          ขอให้ท่านอ่านคำชี้แจงสิทธิส่วนบุคคลของเว็บไซต์เหล่านั้น
        </p>
      </section>

      {/* 13 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          13. การแก้ไขเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
        </p>
        <p className="rf-body  indent-12">
          บริษัทอาจทบทวนและเปลี่ยนแปลงนโยบายความเป็นส่วนตัวในอนาคตเพื่อพัฒนาให้เกิดการคุ้มครองข้อมูลส่วนบุคคลที่ดีขึ้นโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
          ท่านสามารถทราบข้อกำหนดและเงื่อนไขนโยบายที่มีการเปลี่ยนแปลงนี้ได้ผ่านทางเว็บไซต์หรือแอพพลิเคชั่นของมายด์บลูม
          ซึ่งนโยบายนี้มีการแก้ไขล่าสุดและบังคับใช้ตั้งแต่วันที่ 2 เม.ย. 2567
        </p>
      </section>

      {/* 14 */}
      <section className="text-neutral-grey">
        <p className="rf-body font-bold text-left">
          14. ท่านจะติดต่อบริษัทได้อย่างไร
        </p>
        <p className="rf-body  indent-12">
          หากท่านมีข้อเสนอแนะ
          หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้
          และ/หรือเปิดเผยข้อมูลส่วนบุคคล รวมถึงการขอใช้สิทธิตามนโยบายฉบับนี้
          ท่านสามารถติดต่อบริษัทได้ผ่านช่องทางดังนี้
        </p>
        <ul className="rf-body mt-2 list-disc space-y-1 pl-15 text-neutral-grey marker:text-neutral-grey">
          <li className="leading-relaxed">
            Line ID (Customer service): @mindbloom
          </li>
          <li className="leading-relaxed">อีเมล: mindbloom@mindbot-tech.com</li>
        </ul>
      </section>
    </div>
  );
};

export default Policy;
